final List<Map<String, dynamic>> biologyQuestions = [
  {
    "id": 0,
    "text": "ما هو الفرق الأساسي بين DNA و RNA",
    "type": "mcq",
    "options": [
      "DNA يحتوي على اليوراسيل وRNA يحتوي على الثايمين",
      "DNA يتكون من شريط واحد بينما RNA يتكون من شريطين",
      "DNA يحتوي على السكر الرايبوزي منقوص الأكسجين بينما RNA يحتوي على سكر رايبوزي",
      "DNA لا يوجد في النواة بينما RNA يوجد فقط في النواة"
    ],
    "correctIndex": 2,
    "marks": 2,
  },
  {
    "id": 1,
    "text": "ما الوظيفة الأساسية للرايبوسومات في الخلية؟",
    "type": "mcq",
    "options": [
      "إنتاج الطاقة",
      "تخزين المواد الغذائية",
      "إنتاج البروتين",
      "هضم الفضلات"
    ],
    "correctIndex": 2,
    "marks": 2,
  },
  {
    "id": 2,
    "text": "أي العضيات التالية تحتوي على الحمض النووي الخاص بها؟",
    "type": "mcq",
    "options": [
      "جهاز جولجي",
      "الميتوكوندريا",
      "الرايبوسومات",
      "الشبكة الإندوبلازمية"
    ],
    "correctIndex": 1,
    "marks": 2,
  },
  {
    "id": 3,
    "text": "أي مما يلي يميز الخلايا النباتية عن الحيوانية؟",
    "type": "mcq",
    "options": [
      "وجود غشاء بلازمي",
      "وجود نواة",
      "وجود جدار خلوي",
      "وجود ميتوكوندريا"
    ],
    "correctIndex": 2,
    "marks": 2,
  },
  {
    "id": 4,
    "text": "أين يحدث النسخ (transcription) في الخلية؟",
    "type": "mcq",
    "options": [
      "في السيتوبلازم",
      "في الرايبوسومات",
      "في جهاز جولجي",
      "في النواة"
    ],
    "correctIndex": 3,
    "marks": 2,
  },
];
